controllers/SiteController.php

    public function actionIndex()
    {
	$this->checkInstallation();

	$this->layout = 'homePage';
	if (\Yii::$app->user->isGuest)
		return $this->redirect(['site/login']);
        else {
		$isStudent = Yii::$app->session->get('stu_id');
		$isEmployee = Yii::$app->session->get('emp_id');
		$holidayData = \app\models\NationalHolidays::find()->andWhere(['is_status'=>0])->asArray()->all();
---
SELECT * FROM `national_holidays` WHERE (`is_status` <> 2) AND (`is_status`=0)

    public function actionLogin()
    {
	$this->checkInstallation();

        if (!\Yii::$app->user->isGuest) {
            return $this->goHome();
        }

   	$model = new LoginForm();
	$login = new \app\models\LoginDetails();
	if ($model->load(Yii::$app->request->post())) {
		$log = \app\models\User::find()->where(['user_login_id' => $_POST['LoginForm']['username'], 'is_block' => 0])->one();
---
SELECT * FROM `users` WHERE (`user_login_id`='admin') AND (`is_block`=0)