modules/business/controllers/CustomerController.php

    public function actionGettripprice(){

	  $material_id = $_POST['material'];
	  $quantity = $_POST['quantity'];
	  $customer_id = $_POST['customer'];
	  $customerMaterialPrice=CustomerMaterialPrice::findOne(['customer_id'=>$customer_id,'material_id'=>$material_id]);
---
SELECT * FROM `bur_customer_material_price` WHERE (`customer_id`='3') AND (`material_id`='5')