modules/business/views/trips/_form.php

			    'placeholder' => $model->getAttributeLabel('date_of_travel'),'style'=>'width:500px'
		      ],]) ?>

	<?= $form->field($model, 'merchant')
      ->dropDownList(
	  ArrayHelper::map(CustomerDetails::find()->where(['status'=>1,'customer_type'=>1])->all(), 'id', 'name'),
	  ['prompt'=>'Select Merchant','style'=>'width:500px','onChange'=>'merchantAmount();']
      );?>

      <?= $form->field($model, 'buyer')
      ->dropDownList(
	  ArrayHelper::map(CustomerDetails::find()->where(['status'=>1,'customer_type'=>2])->all(), 'id', 'name'),
	  ['prompt'=>'Select Buyer','style'=>'width:500px','onChange'=>'buyerAmount();']
      );?>


    <?= $form->field($model, 'vehicle_id')
      ->dropDownList(
	  ArrayHelper::map(VehicleDetails::find()->where(['status'=>1])->all(), 'id', 'name'),
	  ['prompt'=>'Select Vehicle','style'=>'width:500px','id'=>'vehicle-id','onChange'=>'calculateKMA();']
      );?>
---
SELECT * FROM `bur_customer_details` WHERE (`status`=1) AND (`customer_type`=1)
SELECT * FROM `bur_customer_details` WHERE (`status`=1) AND (`customer_type`=2)
SELECT * FROM `bur_vehicle_details` WHERE `status`=1




     <?= $form->field($model, 'material_id')
      ->dropDownList(
	  ArrayHelper::map(MaterialTypes::find()->where(['status'=>1])->all(), 'id', function($model, $defaultValue) {
			return $model->name.' - '.MaterialTypes::$measurementType[$model->measurement_type];
		    }
	),
	  ['prompt'=>'Select Material','style'=>'width:500px','onChange'=>'merchantAmount();buyerAmount();']
      );?>
---
SELECT * FROM `bur_material_types` WHERE `status`=1